#include <iostream>
using namespace std;
int main()
{
	setlocale (0, "Russian");
	float a, b, c;
	cout << "Дано уравнение: ax^2 + bx + c = 0. Сколько корней имеет данное уравнение и чему они равны при:" << endl;
	cin >> a >> b >> c;
	cout << "a = " << a << "; b = " << b << "; c = " << c << ";\n";
	cout << "(" << a << ") * x^2 + (" << b << ") * x  + (" << c << ") = 0" << endl;
	if (a == 0 && b == 0 && c == 0)
	{
		cout << "Уравнение имеет бесконечное множество корней";
	}
	else
	{
		cout << "Найдем дискриминант по формуле: b^2 - 4ac\n";
		float D, x;
		D = b * b - 4 * a * c;
		cout << "Дискриминант равен: " << D << "." << endl;

		if (D > 0)
		{
			cout << "Дискриминант больше нуля. Значит, всего два корня:" << endl;
			x = (-b + sqrt(D)) / 2 * a;
			cout << "x1 = " << x << "; ";
			x = (-b - sqrt(D)) / 2 * a;
			cout << "x2 = " << x << ";\n";
		}
		else
		{
			if (D == 0)
			{
				cout << "Дискриминант равен нулю. Значит, всего один корень:" << endl;
				x = (-b) / 2 * a;
				cout << "x = " << x << ";\n";
			}
			else
			{
				cout << "Дискриминант меньше нуля. Значит, уравнение не имеет корней\n";
			}
		}
	}
}
